#+AUTHOR: Jesse J. Anderson
#+TITLE: jesse’s emacs config
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

****** Custom Face Definitions for Heex Mode

#+begin_src emacs-lisp

  ;; init.el
  (defface elixir-equal-face nil "")
  (defface elixir-keyword-face nil "")
  (defface elixir-attr-face nil "")
  (defface elixir-number-face nil "")
  (defface elixir-at-variable-face nil "")

  (defun heex-add-custom-faces ()
    (when (member 'eighty-four custom-enabled-themes)
      (font-lock-add-keywords
       nil ;; current buffer
       '(
         ("\\(!=\\|=\\)" (1 'elixir-equal-face))
         ("\\(<%[^>]*\\)\\(if\\|do\\|else\\|end\\)[^>]*\\(%>\\)" (2 'elixir-keyword-face))
         ;; ("\\(<[^>]+\\)\\(:\\w+=\\)" (2 'elixir-attr-face))
         ;; ("\\b\\w+\\s*=\\s*\\{?@?:?\\w+\\}?" (0 'elixir-attr-face))
         ("\\b\\([0-9]+\\)\\b" (1 'elixir-number-face))
         ;; ("\\(<%=\\|<%\\)\\([^>]*@\\w+[^>]\\)\\(%>\\)" (2 'elixir-at-variable-face))
         )
       t ;; append
       )))

  (add-hook 'heex-mode-hook 'heex-add-custom-faces)
  (add-hook 'load-theme-after-hook 'heex-add-custom-faces)

#+end_src

#+RESULTS:
| elixir-add-inner-text-face | heex-add-custom-faces | elixir-add-bracket-face |

#+begin_src emacs-lisp

  (add-hook 'elixir-mode-hook
            (lambda ()
              (setq font-lock-defaults '((elixir-font-lock-keywords) nil nil))))

  (defface elixir-inner-text-face
    '((t (:foreground "#fcfcfc")))
    "Face for the text inside < and > syntax.")

  (defun elixir-add-inner-text-face ()
    (when (member 'eighty-four custom-enabled-themes)
      (font-lock-add-keywords
       nil ;; current buffer
       '(
         ("\\(<[^>]+>\\)\\(\\w+\\)\\(<\\/[^>]+>\\)" (2 'elixir-inner-text-face))
         )
       t ;; prepend
       )))

  (add-hook 'elixir-mode-hook 'elixir-add-inner-text-face)
  (add-hook 'load-theme-after-hook 'elixir-add-inner-text-face)

#+end_src

#+begin_src emacs-lisp

  ;; (defun elixir-add-capital-letter-face ()
  ;;   (when (member 'eighty-four custom-enabled-themes)
  ;;     (font-lock-add-keywords
  ;;      nil ;; current buffer
  ;;      '(
  ;;        ("\\(<[^>]+>\\)\\([A-Z][^<]*\\)\\(<\\/[^>]+>\\)" (2 'elixir-inner-text-face))
  ;;        )
  ;;      t ;; append
  ;;      )))

  ;; (add-hook 'elixir-mode-hook 'elixir-add-capital-letter-face)
  ;; (add-hook 'load-theme-after-hook 'elixir-add-capital-letter-face)

#+end_src

